import './Terms.scss';

const Terms = () => {
  return (
    <div className="terms-container">
      <div className="terms-content">
        <h1>Пользовательское Соглашение</h1>
        <p>Настоящее Пользовательское Соглашение (далее Соглашение) регулирует отношения между владельцем stbuilder.ru (далее stBuilder или Администрация) с одной стороны и пользователем сайта с другой. Сайт stBuilder не является средством массовой информации.</p>
        <p>Используя сайт, Вы соглашаетесь с условиями данного соглашения. Если Вы не согласны с условиями данного соглашения, не используйте сайт stBuilder!</p>

        <h2>Предмет соглашения</h2>
        <p>Администрация предоставляет пользователю право на размещение на сайте следующей информации:</p>
        <ul>
          <li>Текстовой информации</li>
          <li>Фотоматериалов</li>
          <li>Ссылок на материалы, размещенные на других сайтах</li>
        </ul>

        <h2>Права и обязанности сторон</h2>
        <h3>Пользователь имеет право:</h3>
        <ul>
          <li>осуществлять поиск информации на сайте</li>
          <li>получать информацию на сайте</li>
          <li>создавать информацию для сайта</li>
          <li>распространять информацию на сайте</li>
          <li>копировать информацию на другие сайты с указанием источника</li>
          <li>использовать информацию сайта в личных некоммерческих целях</li>
          <li>использовать информацию сайта в коммерческих целях без специального разрешения</li>
        </ul>

        <h3>Администрация имеет право:</h3>
        <ul>
          <li>создавать, изменять, удалять информацию</li>
        </ul>

        <h3>Пользователь обязуется:</h3>
        <ul>
          <li>не нарушать работоспособность сайта</li>
          <li>не размещать материалы рекламного, эротического, порнографического или оскорбительного характера, а также иную информацию, размещение которой запрещено или противоречит нормам действующего законодательства РФ</li>
          <li>не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его Сервисами</li>
        </ul>

        <h3>Администрация обязуется:</h3>
        <ul>
          <li>поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от Администрации причинам</li>
          <li>осуществлять разностороннюю защиту учетной записи Пользователя</li>
        </ul>

        <h2>Ответственность сторон</h2>
        <ul>
          <li>пользователь лично несет полную ответственность за распространяемую им информацию</li>
          <li>администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами</li>
          <li>в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т. д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу информационного ресурса</li>
        </ul>

        <h2>Условия действия Соглашения</h2>
        <p>Данное Соглашение вступает в силу при регистрации на сайте.</p>
        <p>Соглашение перестает действовать при появлении его новой версии.</p>
        <p>Администрация оставляет за собой право в одностороннем порядке изменять данное соглашение по своему усмотрению.</p>
        <p>Администрация не оповещает пользователей об изменении в Соглашении.</p>
      </div>
    </div>
  )
}

export default Terms;